"use strict";

/*
_________________________________________

--- МОДУЛЬ СОРТИРОВКИ ЗАМЕТОК ПО ДАТЕ ---
_________________________________________

*/
window.sortByDate = (function () {
  /*
  ----------------------------------------------------------------------------------
  ---------------------- ВСПОМОГАТЕЛЬНЫЕ ПЕРЕМЕННЫЕ И ФУНКЦИИ ----------------------
  ----------------------------------------------------------------------------------
  */

  // ********* DOM-элементы *********
  var sortByDateButton = document.querySelector("#sortByDateButton");

  var dates = [
    "March/22/2020",
    "January/01/2020",
    "February/13/2020",
    "June/15/2020",
    "August/08/2018"
  ];



  var sortedDates = dates.sort((a, b) => {
    return  a - b;
  });

  console.log(sortedDates);

})();